src/DataProcessors/РабочееМестоСборщикХарьков/РабочееМестоСборщикХарьков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоСборщикХарьков</name>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НакладнаяНаСборку</name>
    <type>
      <types>DocumentRef.НакладнаяНаСборку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/СтатусыНакладныхНаСборку/СтатусыНакладныхНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыНакладныхНаСборку</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыНакладнойНаСборку</types>
    </type>
  </resources>
  <dimensions>
    <name>НакладнаяНаСборку</name>
    <type>
      <types>DocumentRef.НакладнаяНаСборку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыНакладнойНаСборку/СтатусыНакладнойНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыНакладнойНаСборку</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>НаСборке</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>НаУпаковке</name>
  </enumValues>
  <enumValues>
    <name>Упакован</name>
  </enumValues>
</mdclass:Enum>

src/Documents/НакладнаяНаСборку/НакладнаяНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НакладнаяНаСборку</name>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаДоставки</name>
    <type>
      <types>CatalogRef.КартыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомераТары</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрупныйЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БарКоды</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>БарКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗоныКомплектации</name>
    <attributes>
      <name>ЗонаКомплектации</name>
      <type>
        <types>EnumRef.ЗоныКомплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Тары</name>
    <attributes>
      <name>ЗонаКомплектации</name>
      <type>
        <types>EnumRef.ЗоныКомплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.ТранспортировочныеТары</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/РабочееМестоСборщикХарьков/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

&НаСервере
Процедура ПрисвоитьСтатус()
ВнутренниеСчета = Ложь;
	Для каждого ТЧ Из Объект.НакладнаяНаСборку.ТабличнаяЧасть Цикл
	ВнутренниеСчета = ТЧ.ЗаказНаПроизводство.ВнутренниеСчета;
		Если Не ЗначениеЗаполнено(ТЧ.Исполнитель) Тогда
		Возврат;
		КонецЕсли; 
	КонецЦикла; 
СННС = РегистрыСведений.СтатусыНакладныхНаСборку.СоздатьМенеджерЗаписи();
СННС.Период = ТекущаяДата();
СННС.НакладнаяНаСборку = Объект.НакладнаяНаСборку;
	Если ВнутренниеСчета Тогда
	СННС.Статус = Перечисления.СтатусыНакладнойНаСборку.НаУпаковке; 
	ИначеЕсли СокрЛП(Объект.НакладнаяНаСборку.Контрагент.Код) = "99999951578" Тогда
	СННС.Статус = Перечисления.СтатусыНакладнойНаСборку.НаУпаковке;
	Иначе	
	СННС.Статус = Перечисления.СтатусыНакладнойНаСборку.Собран;
	КонецЕсли;
СННС.Записать();
КонецПроцедуры

&НаСервере
Процедура ЗавершитьЗаданиеНаСервере()
ДатаОкончания = ТекущаяДата();
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	ННС = Объект.НакладнаяНаСборку.ПолучитьОбъект();
		Для каждого НомерТары Из НомераТары Цикл	
		ННС.НомераТары = СокрЛП(НомерТары.Значение) + ",";
		КонецЦикла;
	ННС.НомераТары = Лев(ННС.НомераТары,СтрДлина(СокрЛП(ННС.НомераТары))-1);
		Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл 
		Выборка = ННС.ТабличнаяЧасть.НайтиСтроки(Новый Структура("Товар",ТЧ.Товар));
			Для к = 0 По Выборка.ВГраница() Цикл
			Выборка[к].Исполнитель = Объект.Исполнитель;
			Выборка[к].ДатаОкончания = ДатаОкончания;
			КонецЦикла; 		
		КонецЦикла;	
	ННС.Записать(РежимЗаписиДокумента.Запись);
	ПрисвоитьСтатус();
	Объект.НакладнаяНаСборку = Документы.НакладнаяНаСборку.ПустаяСсылка();
	НомераТары.Очистить();
	Объект.ТабличнаяЧасть.Очистить();
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки());
	КонецПопытки; 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗадание(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ЗавершитьЗаданиеНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанные(Данные)
Массив = ОбщийМодульВызовСервера.РазложитьСтрокуВМассив(Данные,";");
ННС = ЗначениеИзСтрокиВнутр(Массив[1]);
	Если ПроверитьСтатусННС(ННС) Тогда
	Объект.НакладнаяНаСборку = ННС;
	флЧётность = Ложь;
		Для к = 2 По Массив.ВГраница() Цикл
			Если флЧётность Тогда
			флЧётность = Ложь;
			Иначе
			ТЧ = Объект.ТабличнаяЧасть.Добавить();
			ТЧ.Товар = Справочники.Товары.НайтиПоКоду(Число(Массив[к]));
			ТЧ.Количество = Число(Массив[к+1]);	
			флЧётность = Истина;
			КонецЕсли;	
		КонецЦикла;
	Иначе
	Сообщить("Отсканируйте документ в статусе На сборке!");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудника(Данные)
Возврат(ЗначениеИзСтрокиВнутр(Данные));
КонецФункции

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
		Если Найти(Данные,";") > 0 Тогда
		ПолучитьДанные(Данные);
		ИначеЕсли Найти(Данные,"{") > 0 Тогда	
		Объект.Исполнитель = ПолучитьСотрудника(Данные);
		Иначе
			Если НомераТары.НайтиПоЗначению(СокрЛП(Данные)) = Неопределено Тогда
			НомераТары.Добавить(СокрЛП(Данные));
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанные(Команда)
	Если Найти(ДанныеСканера,";") > 0 Тогда
	ПолучитьДанные(ДанныеСканера);
	ИначеЕсли Найти(ДанныеСканера,"{") > 0 Тогда	
	Объект.Исполнитель = ПолучитьСотрудника(ДанныеСканера);
	Иначе
		Если НомераТары.НайтиПоЗначению(СокрЛП(ДанныеСканера)) = Неопределено Тогда
		НомераТары.Добавить(СокрЛП(ДанныеСканера));
		КонецЕсли;
	КонецЕсли;
ДанныеСканера = "";
КонецПроцедуры

&НаСервере
Процедура ДобавитьТоварыВТаблицу()
	Для каждого ТЧ Из Объект.НакладнаяНаСборку.ТабличнаяЧасть Цикл
	ТЧ_ТЧ = Объект.ТабличнаяЧасть.Добавить();
	ТЧ_ТЧ.Товар = ТЧ.Товар;
	ТЧ_ТЧ.Количество = ТЧ.Количество;	
	КонецЦикла;  
КонецПроцедуры
 
&НаКлиенте
Процедура НакладнаяНаСборкуОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
Объект.НакладнаяНаСборку = ВыбранноеЗначение;
ДобавитьТоварыВТаблицу();
КонецПроцедуры

&НаСервере
Функция ПроверитьСтатусННС(НакладнаяНаСборку)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыНакладныхНаСборкуСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыНакладныхНаСборку.СрезПоследних КАК СтатусыНакладныхНаСборкуСрезПоследних
	|ГДЕ
	|	СтатусыНакладныхНаСборкуСрезПоследних.НакладнаяНаСборку = &НакладнаяНаСборку";
Запрос.УстановитьПараметр("НакладнаяНаСборку", НакладнаяНаСборку);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Статус = Перечисления.СтатусыНакладнойНаСборку.НаСборке Тогда
		Возврат(Истина);
		Иначе
		Возврат(Ложь);
		КонецЕсли; 
	КонецЦикла;
Возврат(Ложь);
КонецФункции

&НаКлиенте
Процедура НакладнаяНаСборкуПриИзменении(Элемент)
	Если Не ПроверитьСтатусННС(Объект.НакладнаяНаСборку) Тогда	
	Сообщить("Выберите документ в статусе На сборке!");
	Объект.НакладнаяНаСборку = "";
	КонецЕсли; 	
КонецПроцедуры
